"""
Host Checker - Backend API
Сервис проверки хостов и DNS резолвинга

Для запуска фронтенда см. файл FRONTEND_SETUP.md

Backend TODO:
1. Настроить FastAPI
2. Подключить PostgreSQL и Redis
3. Реализовать API endpoints:
   - POST /api/checks - создать проверку
   - GET /api/checks - список проверок
   - GET /api/checks/{id} - получить проверку
   - GET /api/agents - список агентов
   - POST /api/agents/register - регистрация агента
   - POST /api/agents/heartbeat - heartbeat агента
4. Реализовать систему очередей (Redis)
5. Реализовать WebSocket для real-time обновлений

См. документацию в папке docs/
Особенно полезны:
- docs/ARCHITECTURE.md - архитектура системы
- docs/PROJECT_STRUCTURE.md - структура кода
- docs/IMPLEMENTATION_PLAN.md - план реализации
"""

if __name__ == "__main__":
    print("Backend еще не реализован")
    print("Фронтенд уже готов и работает! См. FRONTEND_SETUP.md")
    print("\nДля запуска фронтенда:")
    print("  cd frontend")
    print("  npm install")
    print("  npm run dev")

